In [1]:
import numpy as np 
import pandas as pd

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.254427  1.154469 -0.448399  0.127100
2013-01-02 -0.866212  0.631459  0.857951 -0.250342
2013-01-03  0.818595  0.981550  0.180145  0.384944
2013-01-04  1.956163  1.534419  0.068130  0.115988
2013-01-05 -0.809996  1.134926  0.362024  0.273696
2013-01-06 -0.514591  0.306302  0.372244  1.856588

In [8]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.054922  0.957188  0.232016  0.417996
std    1.114857  0.432216  0.429156  0.736745
min   -0.866212  0.306302 -0.448399 -0.250342
25%   -0.736145  0.718982  0.096134  0.118766
50%   -0.384509  1.058238  0.271085  0.200398
75%    0.550339  1.149584  0.369689  0.357132
max    1.956163  1.534419  0.857951  1.856588

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.254427   -0.866212    0.818595    1.956163   -0.809996   -0.514591
B    1.154469    0.631459    0.981550    1.534419    1.134926    0.306302
C   -0.448399    0.857951    0.180145    0.068130    0.362024    0.372244
D    0.127100   -0.250342    0.384944    0.115988    0.273696    1.856588

In [20]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  0.127100 -0.448399  1.154469 -0.254427
2013-01-02 -0.250342  0.857951  0.631459 -0.866212
2013-01-03  0.384944  0.180145  0.981550  0.818595
2013-01-04  0.115988  0.068130  1.534419  1.956163
2013-01-05  0.273696  0.362024  1.134926 -0.809996
2013-01-06  1.856588  0.372244  0.306302 -0.514591

In [21]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-06 -0.514591  0.306302  0.372244  1.856588
2013-01-02 -0.866212  0.631459  0.857951 -0.250342
2013-01-03  0.818595  0.981550  0.180145  0.384944
2013-01-05 -0.809996  1.134926  0.362024  0.273696
2013-01-01 -0.254427  1.154469 -0.448399  0.127100
2013-01-04  1.956163  1.534419  0.068130  0.115988

In [23]:
df['A']

2013-01-01   -0.254427
2013-01-02   -0.866212
2013-01-03    0.818595
2013-01-04    1.956163
2013-01-05   -0.809996
2013-01-06   -0.514591
Freq: D, Name: A, dtype: float64

In [25]:
df[0:5]

                   A         B         C         D
2013-01-01 -0.254427  1.154469 -0.448399  0.127100
2013-01-02 -0.866212  0.631459  0.857951 -0.250342
2013-01-03  0.818595  0.981550  0.180145  0.384944
2013-01-04  1.956163  1.534419  0.068130  0.115988
2013-01-05 -0.809996  1.134926  0.362024  0.273696

In [26]:
df.loc[dates[0]]

A   -0.254427
B    1.154469
C   -0.448399
D    0.127100
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.254427  1.154469
2013-01-02 -0.866212  0.631459
2013-01-03  0.818595  0.981550
2013-01-04  1.956163  1.534419
2013-01-05 -0.809996  1.134926
2013-01-06 -0.514591  0.306302

In [28]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.956163  1.534419
2013-01-05 -0.809996  1.134926

In [ ]:
df[df.A > 0]